Autodesk.Revit.DB.IGeometryAugmentationServerProxy.GetMoveConstraints(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.MoveConstraintSettings)
Provides a way to constrain the movement of a movable geometry object.
Remarks:
This function is called whenever a movable external geometry is about to move.
Use it to provide a way to optionally restrict the movement in different ways using the settings object.
document:
The document where the target element exists.
viewId:
The id of the view where this element will be drawn.
targetId:
The id for the element that owns the ExternalGeometryId.
geometryId:
The ExternalGeometryId of the moving geometry.
moveConstraintSettings:
Use this object to customize the move constraint settings.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServerProxy.GetCoordinateSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Provides the coordinate system for the movable geometry. This coordinate system is where the offset transforms are stored relative to it.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Since:
2025

Autodesk.Revit.DB.IGeometryAugmentationServerProxy.GetMovableReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Provides a list of all the ExternalGeometryId that are going to be movable in this element.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Returns:
Set containing all the ExternalGeometryIds that are going to be movable in this element.
Since:
2025